# Import librs

In [1]:
import numpy as np
import pandas as pd

In [2]:
#load the Titanic_DS dataset
df= pd.read_csv("Titanic_DS.csv")

In [3]:
#inspect the first few rows of the Titanic_DS dataset
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
# set the index to passengerId
# set_index()
# df.set_index("PassengerId" , inplace=True)
df.set_index("PassengerId" , inplace=True)

In [6]:
#by calling the shape attribute of the Titanic_DS dataset we can observe that there are 909 observations and 11 columns
#in the data set
df.shape

(909, 11)

In [9]:
# identify datatypes of the 11 columns, add the stats to the new DataFrame called "Data_stats"
# pd.DataFrame(df.dtypes)
Data_stats=pd.DataFrame(df.dtypes)

In [12]:
# identify missing values of the 11 columns,add the stats to the "Data_stats"
Data_stats["Missing"]=df.isna().sum()
Data_stats.head()

                0  Missing
Survived    int64        0
Pclass      int64        0
Name       object        0
Sex        object        0
Age       float64      178

In [15]:
# Identify number of nunique values, For object nunique will the number of levels
# Add the stats the "Data_stats"
Data_stats["Num_unique"]=df.nunique()
Data_stats.head()

                0  Missing  Num_unique
Survived    int64        0           2
Pclass      int64        0           3
Name       object        0         891
Sex        object        0           2
Age       float64      178          88

In [17]:
# Identify the count for each variable, add the stats to "Data_stats"
Data_stats["Count"]=df.count()
Data_stats.head()

                0  Missing  Num_unique  Count
Survived    int64        0           2    909
Pclass      int64        0           3    909
Name       object        0         891    909
Sex        object        0           2    909
Age       float64      178          88    731

In [22]:
# rename the 0 column  {0:'DataType'}
# Data_stats =  Data_stats.rename(columns={0:"DataType"})
Data_stats.rename(columns={0: "DataType"}, inplace=True)
Data_stats.head()

         DataType  Missing  Num_unique  Count
Survived    int64        0           2    909
Pclass      int64        0           3    909
Name       object        0         891    909
Sex        object        0           2    909
Age       float64      178          88    731

In [24]:
Data_stats.to_csv("Data_stats_P_Titanic.csv")

In [28]:
# get discripte statistcs on "object" datatypes
df.describe(include="object")

,Name,Sex,Ticket,Cabin,Embarked
count,909,909,909,208,907
unique,891,2,681,147,3
top,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",male,347082,G6,S
freq,3,585,8,6,658

In [31]:
# get discriptive statistcs on "number" datatypes
round(df.describe(), 2)

       Survived  Pclass     Age   SibSp   Parch    Fare
count    909.00  909.00  731.00  909.00  909.00  909.00
mean       0.39    2.31   29.63    0.53    0.39   32.02
std        0.49    0.84   14.65    1.10    0.82   49.28
min        0.00    1.00    0.42    0.00    0.00    0.00
25%        0.00    2.00   20.00    0.00    0.00    7.92
50%        0.00    3.00   28.00    0.00    0.00   14.46
75%        1.00    3.00   38.00    1.00    0.00   31.00
max        1.00    3.00   80.00    8.00    6.00  512.33

In [35]:
# train.Survived.value_counts(normalize=True)
df["Survived"].value_counts(normalize=True)

Survived
0    0.613861
1    0.386139
Name: proportion, dtype: float64

In [33]:
558/909

0.6138613861386139

In [44]:
# Feature Engineering Data- Extract title from name, Extract new features from the other features
# Titanic_DS['Name_len']

df["Name_Title"]=df["Name"].str.split(expand=True)[1]
df["Name_Length"]=df["Name"].str.len()
df.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Name_Title,Name_Length
PassengerId,,,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,Mr.,23
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,Mrs.,51
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,Miss.,22
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,Mrs.,44
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,Mr.,24

In [46]:
# mark zero values as  NaN
sum(df["Fare"]== 0)

15

In [47]:
df["Fare"].replace({0: np.nan},inplace=True)

In [48]:
# Check again to see if there are no more zero values in column "Fare"
sum(df["Fare"]== 0)

0

In [54]:
# Get the mean of the data in col "Fare"
Fare_mean=df["Fare"].mean()
Fare_mean

32.560471700223715

In [56]:
df["Fare"].isna().sum()

15

In [59]:
# impute the missing Fare values with the mean Fare value
df["Fare"]=df["Fare"].fillna(Fare_mean)
df["Fare"].head()

PassengerId
1     7.2500
2    71.2833
3     7.9250
4    53.1000
5     8.0500
Name: Fare, dtype: float64

In [60]:
# validate if any null values are present after the imputation
df["Fare"].isna().sum()

0

In [61]:
# we see that there are 0 Zero values in col "Age"
sum(df["Age"]== 0)

0

In [71]:
df["Age"].isna().sum()

0

In [72]:
# impute the missing Age values with the mean Age value
df["Age"]=df["Age"].fillna(df["Age"].mean())
df["Age"].head()

PassengerId
1    22.0
2    38.0
3    26.0
4    35.0
5    35.0
Name: Age, dtype: float64

In [73]:
# validate if any null values are present after the imputation
df["Age"].isna().sum()

0

In [74]:
# We see that a majority 77% of the Cabin variable has missing values.
# Hence will drop the column from training a machine learnign algorithem
# How to check the ratio of the missing data in col "Cabin"

df["Cabin"].isna().sum()/df.shape[0]

0.7711771177117712

In [76]:
#df.drop(columns=['Cabin'])
df.drop("Cabin" , axis=1)

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked,Name_Title,Name_Length
PassengerId,,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,S,Mr.,23
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C,Mrs.,51
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,S,Miss.,22
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,S,Mrs.,44
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,S,Mr.,24
...,...,...,...,...,...,...,...,...,...,...,...,...
39,0,3,"Vander Planke, Miss. Augusta Maria",female,18.0,2,0,345764,18.0000,S,"Planke,",34
9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,S,Mrs.,49
10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,C,Mrs.,35
11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,S,Miss.,31
12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,S,Miss.,24

In [79]:
# Check duplicated rows 
df.duplicated().sum()

18

In [81]:
# Drop duplicated rows 
df.drop_duplicates(inplace=True)

In [82]:
# Check again
df.duplicated().sum()

0